# Intro to Pandas

* An open-source built on numpy
* It allows for fast analysis and data cleaning and prep
* It excels in performance and productivity
* It also has built-in visualization features
* And, it canwork with data from a wide variety of sources

In this course we are going to cover:

    1. Series
    2. DataFrames
    3. Missing Data
    4. GroupBy
    5. Merging, joining, and concatenating
    6. Data operations
    7. Data I/O

In [1]:
import pandas as pd
import numpy as np

## Series

In [2]:
# Similar to numpy array, except that a series has axis labels
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
# let's create a series
series = pd.Series(data = my_data)

In [4]:
series

0    10
1    20
2    30
dtype: int64

In [5]:
# let's recreate
series = pd.Series(data=my_data,index=labels)
series

a    10
b    20
c    30
dtype: int64

In [6]:
# get a parameter from a series
series['a']

10

In [7]:
# Another way
series = pd.Series(arr)
series

0    10
1    20
2    30
dtype: int64

In [8]:
# Another way
series = pd.Series(d)
series

a    10
b    20
c    30
dtype: int64

Note that passing a dictionary into the series creates a keyword:value association in the panda series.
You can also pass strings as "data" into a series. I suppose this is an easy way to import CSV files in Pandas. Series are also a lot like structures in MATLAB.

In [9]:
# index names allow for fast lookups of information!
series1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
series2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [10]:
# Again, get a value
series1['USA']

1

In [11]:
series3 = pd.Series(data=labels)

In [12]:
# you can reference values from indices too.
series3[0]

'a'

In [13]:
# you can add series together, e.g.,
series1 + series2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

Since USSR isnt in series2 and Italy is not in series1, pandas has put a NaN in these locations (i.e., can't be added if both series don't contain the same keyword:values)!

## Data Frames

In [14]:
# we're going to set a 'seed' for the random number generator to get repeatable results
from numpy.random import randn
np.random.seed(101)

In [15]:
# create a data frame from random data
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [16]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

So this tool is a lot like "Tables" in MATLAB

In [17]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
df['W']['A']

2.706849839399938

In [19]:
# get multiple columns
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [20]:
# add a new column
df['new'] = df['W'] + df['Y'] # addition of W and Y

In [21]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [22]:
# remove columns!
df.drop('new',axis=1) #note you need to specify axis=1 here! axis=1 is columns

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
# However, this doesn't occur in place, e.g.,
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [24]:
df.drop('new',axis=1,inplace=True) #this removes the new column

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
# You can also drop rows,
df.drop('E',axis=0) # zero axis is rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [27]:
# Get the shape of a data frame. This creates a tuple of (rows,columns)
df.shape

(5, 4)

In [28]:
# Selecting rows. You have to use a method call to 'loc'
df.loc['D']

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [29]:
# Selecting rows. Here is another way with indices
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [30]:
# You can also get (row,column) values using loc
df.loc['A','Y']

0.9079694464765431

In [31]:
# get multiple values, pass in a list of row/column names
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [32]:
# Conditional selection
df > 1

       W      X      Y      Z
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True   True  False

In [33]:
df[df>1]

         W         X         Y   Z
A  2.70685       NaN       NaN NaN
B      NaN       NaN       NaN NaN
C      NaN       NaN       NaN NaN
D      NaN       NaN       NaN NaN
E      NaN  1.978757  2.605967 NaN

In [34]:
# you can also do this
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
# A few more examples. Grab rows in data frame where z < 0. Note this is only true in row C
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [36]:
# Grab values from Row A off parsed data frame. Note use of 'loc' method call here.
df[df['W']>0].loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [37]:
# Grab values from column X off parsed data frame
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [38]:
# Use two conditionals to get some data. Note you have to use "&" instead of "and" here.
# "&" accounts for multiple booleans, whereas "and" accounts for only one. 
# HINT: try running the below code with "and" instead of "&". It will result in an error.
# You can do "or" with "|" as well. This is more MATLAB syntax in Python.

df[(df['W']>0) & (df['Y']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [39]:
# Data frame index
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
# Add numerical indices to data frame
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [41]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
newind = 'CA NY WY CO OR'.split() # A quick way to make a list

In [43]:
# Add newind to data frame
df['states'] = newind

In [44]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     CO
E  0.190794  1.978757  2.605967  0.683509     OR

In [45]:
# Now we can make this column the new index...
df.set_index('states')

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
CO      0.188695 -0.758872 -0.933237  0.955057
OR      0.190794  1.978757  2.605967  0.683509

In [46]:
# Note this above step doesn't occur in place, unless you specify it.
# df.set_index('states',inplace=True)
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     CO
E  0.190794  1.978757  2.605967  0.683509     OR

In [47]:
# Multi index and index heiarchy
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [48]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [49]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [50]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

Ah, ok there are two indices, G1 and G2, and 1,2,3

In [51]:
# How do we reference df?
df.loc['G1'].loc[1] # DOUBLE LOC

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [52]:
# Give the unnamed indices names
df.index.names = ['Groups','Nums']

In [53]:
df

                    A         B
Groups Nums
G1     1     0.302665  1.693723
       2    -1.706086 -1.159119
       3    -0.134841  0.390528
G2     1     0.166905  0.184502
       2     0.807706  0.072960
       3     0.638787  0.329646

In [54]:
# Now grab information from df one more time
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [55]:
# Another useful function, cross section. It's a shortcut of the above
df.xs('G1')

             A         B
Nums
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [56]:
# you can also specify indices where Nums = 1 by specifying 1 and then level=Nums
df.xs(1,level='Nums')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## Missing Data

In [57]:
# Create a dictionary with some nans
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [58]:
# Transform dictionary to data frame
df = pd.DataFrame(d)

In [59]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [60]:
# Drops all rows with any missing values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [61]:
# Drop all rows with any missing values
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [62]:
# Use a threshold to drop rows that contain nan values above a certain number
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [63]:
# with columns
df.dropna(axis=1,thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [64]:
# fill nans
df.fillna(value='9999')

      A     B  C
0   1.0   5.0  1
1   2.0  9999  2
2  9999  9999  3

In [65]:
# fill nans in A with mean of column A
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## GroupBy

* Similar to SQL statememt
* Group rows by a column, then perform some kind of aggregate function
* For example, grouping by ID, then taking the sum of the numbers in the ID

In [66]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [67]:
df = pd.DataFrame(data)

In [68]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [69]:
# Group rows together based on a column name
byComp = df.groupby('Company')

In [70]:
# Compute mean of values in each company
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [71]:
# sum... std... etc.
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [72]:
# Now with indexing!
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [73]:
# This can be a one-liner too...
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [74]:
# counts
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [75]:
# max and min
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [76]:
# describe method... gets statistics of data frame!
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## Merging, Joining, and Concatenating

### Concatenation:

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [77]:
# Create some data
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [78]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [79]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [80]:
# Concatenation
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Merging:

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [81]:
# Create some more example data frames
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [82]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [83]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [84]:
# Note that the keys are the same between left and right. 
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

If you end up using this method, check out the documentation for different merge types (how='')

### Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [85]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [86]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [87]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations

In [88]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [89]:
# find unique values in a data frame
df['col2'].unique()

array([444, 555, 666])

In [90]:
# Count unique values in a data frame
df['col2'].nunique()

3

In [91]:
# how many times a unique value occured in a data frame
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [92]:
# Selecting data
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [93]:
# Apply method
def times2(x):
    return x*2

In [94]:
# applies function to a data frame!
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

However, it's much better to use <code>apply</code> with a lamba expression, as not to have to define a complicated function first before applying it to a data frame.

In [95]:
# e.g., 
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [96]:
# removing columns. If you want it to occur in place, specify 'inplace=True'
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [97]:
# grab column name
df.columns[0]

'col1'

In [98]:
# Sorting and ordering
# Sort by column 2
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [99]:
# find nan values
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [100]:
# pivot table
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [101]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [102]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

And finally...

## Data I/O

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

* CSV
* Excel (.xlsx)
* HTML
* SQL

### CSV Files

In [103]:
path = '/mnt/c/Users/bknorris/Documents/Scripts/Python/Python_for_data_science/Py_DS_ML_Bootcamp/03-Python-for-Data-Analysis-Pandas/'
df = pd.read_csv(path+'example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [104]:
# write to csv. Note you have to specify index=False if you don't want to save the indices column!
df.to_csv(path+'my_output',index=False)

### Excel Files

In [108]:
df = pd.read_excel(path+'Excel_sample.xlsx')

In [106]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [109]:
#writing... I'm not going to run this cell
df.to_excel('Excel_Sample2.xlsx',sheet_name='Sheet1')

### HTML

In [111]:
# Grab a table from a website
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [112]:
df

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [113]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

Will skip the section on SQL for now. I won't be using it for some time.